[{"title": "NASA's Mars 2020 Comes Full Circle", "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "}, {"title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"title": "Mars Scientists Investigate Ancient Life in Australia", "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "}, {"title": "NASA's Mars Perseverance Rover Passes Flight Readiness Review", "preview": "​The agency's Mars 2020 mission has one more big prelaunch review – the Launch Readiness Review, on July 27."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}]